```bash
docker run --name mysql-container -e MYSQL_ROOT_PASSWORD=my-secret-pw -p 3306:3306 -d mysql:latest
```

```bash
docker exec -it mysql-container mysql -u root -p
```

In [1]:
%load_ext sql
%sql mysql+mysqldb://root:my-secret-pw@127.0.0.1/testdb
%config SqlMagic.style = '_DEPRECATED_DEFAULT'

In [ ]:
%%sql 
# create database msc2025;
USE msc2025;
SHOW databases;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
0 rows affected.
6 rows affected.

[('information_schema',),
 ('msc2025',),
 ('mysql',),
 ('performance_schema',),
 ('sys',),
 ('testdb',)]

In [52]:
%%sql 
select version(), current_date(), user();

 * mysql+mysqldb://root:***@127.0.0.1/testdb
1 rows affected.

[('9.2.0', datetime.date(2025, 4, 4), 'root@172.17.0.1')]

In [71]:
%%sql
SHOW TABLES;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
1 rows affected.

[('students',)]

In [55]:
%%sql
drop table if exists students;
create table students(ID INT(2), Name varchar(30), Gender CHAR(1));
insert into students(ID, Name, Gender) values (1, 'John Doe', "M"), (2, 'Jane', "F");
select * from students;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
0 rows affected.
0 rows affected.
2 rows affected.
2 rows affected.

[(1, 'John Doe', 'M'), (2, 'Jane', 'F')]

In [57]:
%%sql
select * from students
where Gender = 'M';

 * mysql+mysqldb://root:***@127.0.0.1/testdb
1 rows affected.

[(1, 'John Doe', 'M')]

In [66]:
%%sql
select * from students
where Name LIKE 'J%';

 * mysql+mysqldb://root:***@127.0.0.1/testdb
2 rows affected.

[(1, 'John Doe', 'M'), (2, 'Jane', 'F')]

In [76]:
%%sql
select * from students
where Name LIKE 'J___' and Gender = 'F';

 * mysql+mysqldb://root:***@127.0.0.1/testdb
1 rows affected.

[(2, 'Jane', 'F')]

## Exercise 1

In [92]:
%%sql
drop table if exists city;
create table city(Name varchar(50), CountryCode char(3), District varchar(50), Population int);
insert into city(Name, CountryCode, District, Population) 
values 
('New York', 'USA', 'New York', 8175133),
('Los Angeles', 'USA', 'California', 3792621),
('Chicago', 'USA', 'Illinois', 2695598),
('Houston', 'USA', 'Texas', 2129784),
('Phoenix', 'USA', 'Arizona', 1445632),
('Kabul', 'AFG', 'Kabol', 3043532),
('Kandahar', 'AFG', 'Kandahar', 491500),
('Herat', 'AFG', 'Herat', 436300),
('Mazar-e-Sharif', 'AFG', 'Balkh', 375000),
('Jalalabad', 'AFG', 'Nangarhar', 205000),
('London', 'GBR', 'England', 8787892),
('Birmingham', 'GBR', 'England', 1141816),
('Manchester', 'GBR', 'England', 553230),
('Glasgow', 'GBR', 'Scotland', 612040),
('Liverpool', 'GBR', 'England', 491500),
('Tokyo', 'JPN', 'Tokyo', 13929286),
('Osaka', 'JPN', 'Osaka', 2691186),
('Nagoya', 'JPN', 'Aichi', 2295638),
('Sapporo', 'JPN', 'Hokkaido', 1952356),
('Fukuoka', 'JPN', 'Fukuoka', 1617428),
('Paris', 'FRA', 'Île-de-France', 2148327),
('Marseille', 'FRA', 'Provence-Alpes-Côte d\'Azur', 861635),
('Lyon', 'FRA', 'Auvergne-Rhône-Alpes', 513275),
('Toulouse', 'FRA', 'Occitanie', 471941),
('Nice', 'FRA', 'Provence-Alpes-Côte d\'Azur', 342522),
('Berlin', 'DEU', 'Berlin', 3769495),
('Hamburg', 'DEU', 'Hamburg', 1841179),
('Munich', 'DEU', 'Bavaria', 1471508),
('Cologne', 'DEU', 'North Rhine-Westphalia', 1085664),
('Frankfurt', 'DEU', 'Hesse', 753056);
select * from city limit 5;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
0 rows affected.
0 rows affected.
30 rows affected.
5 rows affected.

[('New York', 'USA', 'New York', 8175133),
 ('Los Angeles', 'USA', 'California', 3792621),
 ('Chicago', 'USA', 'Illinois', 2695598),
 ('Houston', 'USA', 'Texas', 2129784),
 ('Phoenix', 'USA', 'Arizona', 1445632)]

In [93]:
%%sql
select * from city limit 5;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
5 rows affected.

[('New York', 'USA', 'New York', 8175133),
 ('Los Angeles', 'USA', 'California', 3792621),
 ('Chicago', 'USA', 'Illinois', 2695598),
 ('Houston', 'USA', 'Texas', 2129784),
 ('Phoenix', 'USA', 'Arizona', 1445632)]

In [95]:
%%sql
select * from city where CountryCode="AFG";

 * mysql+mysqldb://root:***@127.0.0.1/testdb
5 rows affected.

[('Kabul', 'AFG', 'Kabol', 3043532),
 ('Kandahar', 'AFG', 'Kandahar', 491500),
 ('Herat', 'AFG', 'Herat', 436300),
 ('Mazar-e-Sharif', 'AFG', 'Balkh', 375000),
 ('Jalalabad', 'AFG', 'Nangarhar', 205000)]

In [98]:
%%sql
select CountryCode from city limit 5;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
5 rows affected.

[('USA',), ('USA',), ('USA',), ('USA',), ('USA',)]

In [110]:
%%sql
select distinct CountryCode from city;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
6 rows affected.

[('USA',), ('AFG',), ('GBR',), ('JPN',), ('FRA',), ('DEU',)]

In [111]:
%%sql
describe city;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
4 rows affected.

[('Name', 'varchar(50)', 'YES', '', None, ''),
 ('CountryCode', 'char(3)', 'YES', '', None, ''),
 ('District', 'varchar(50)', 'YES', '', None, ''),
 ('Population', 'int', 'YES', '', None, '')]

In [119]:
%%sql
select count(distinct(CountryCode)) from city;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
1 rows affected.

[(6,)]

In [132]:
%%sql
select CountryCode, count(distinct(District)) from city
group by CountryCode;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
6 rows affected.

[('AFG', 5), ('DEU', 5), ('FRA', 4), ('GBR', 2), ('JPN', 5), ('USA', 5)]

In [136]:
%%sql
select CountryCode, count(distinct(District)) from city
group by CountryCode
having count(distinct(District)) > 4;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
4 rows affected.

[('AFG', 5), ('DEU', 5), ('JPN', 5), ('USA', 5)]

## Exercise 2

In [137]:
%%sql
create database company;
show databases;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
1 rows affected.
7 rows affected.

[('company',),
 ('information_schema',),
 ('msc2025',),
 ('mysql',),
 ('performance_schema',),
 ('sys',),
 ('testdb',)]

In [140]:
%%sql
use company;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
0 rows affected.

[]

In [214]:
%%sql
drop table if exists employees;
create table employees(
    id INT AUTO_INCREMENT PRIMARY KEY,
    name varchar(100) NOT NULL,
    position varchar(50) NOT NULL,
    salary DECIMAL(10, 2) NOT NULL,
    hire_date DATE
);

 * mysql+mysqldb://root:***@127.0.0.1/testdb
0 rows affected.
0 rows affected.

[]

In [215]:
%%sql 
insert into employees(name, position, salary, hire_date)
values 
('Alice Smith', 'Manager', 75000, '2018-06-23'),
('Bob Johnson', 'Developer', 65000, '2019-08-15'),
('Charlie Lee', 'Designer', 60000, '2020-04-12'),
('David Wilson', 'Developer', 68000, '2021-01-20'),
('Eva Brown', 'HR', 55000, '2017-11-05');
select * from employees;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
5 rows affected.
5 rows affected.

[(1, 'Alice Smith', 'Manager', Decimal('75000.00'), datetime.date(2018, 6, 23)),
 (2, 'Bob Johnson', 'Developer', Decimal('65000.00'), datetime.date(2019, 8, 15)),
 (3, 'Charlie Lee', 'Designer', Decimal('60000.00'), datetime.date(2020, 4, 12)),
 (4, 'David Wilson', 'Developer', Decimal('68000.00'), datetime.date(2021, 1, 20)),
 (5, 'Eva Brown', 'HR', Decimal('55000.00'), datetime.date(2017, 11, 5))]

In [209]:
%%sql
describe employees;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
5 rows affected.

[('id', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('name', 'varchar(100)', 'NO', '', None, ''),
 ('position', 'varchar(50)', 'NO', '', None, ''),
 ('salary', 'decimal(10,2)', 'NO', '', None, ''),
 ('hire_date', 'date', 'YES', '', None, '')]

In [216]:
%%sql
select avg(salary) as average_salary from employees;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
1 rows affected.

[(Decimal('64600.000000'),)]

In [ ]:
%%sql
select * from employees
where position like 'd%';

 * mysql+mysqldb://root:***@127.0.0.1/testdb
3 rows affected.

[(2, 'Bob Johnson', 'Developer', Decimal('65000.00'), datetime.date(2019, 8, 15)),
 (3, 'Charlie Lee', 'Designer', Decimal('60000.00'), datetime.date(2020, 4, 12)),
 (4, 'David Wilson', 'Developer', Decimal('68000.00'), datetime.date(2021, 1, 20))]

In [226]:
%%sql
select avg(salary) as avg_salary_of_devs from employees
where position = 'Developer';

 * mysql+mysqldb://root:***@127.0.0.1/testdb
1 rows affected.

[(Decimal('66500.000000'),)]

In [232]:
%%sql
CURDATE()

 * mysql+mysqldb://root:***@127.0.0.1/testdb
(MySQLdb.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'CURDATE()' at line 1")
[SQL: CURDATE()]
(Background on this error at: https://sqlalche.me/e/20/f405)

In [237]:
%%sql
select *, DATEDIFF(CURDATE(), hire_date) as service_period
from employees;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
5 rows affected.

[(1, 'Alice Smith', 'Manager', Decimal('75000.00'), datetime.date(2018, 6, 23), 2477),
 (2, 'Bob Johnson', 'Developer', Decimal('65000.00'), datetime.date(2019, 8, 15), 2059),
 (3, 'Charlie Lee', 'Designer', Decimal('60000.00'), datetime.date(2020, 4, 12), 1818),
 (4, 'David Wilson', 'Developer', Decimal('68000.00'), datetime.date(2021, 1, 20), 1535),
 (5, 'Eva Brown', 'HR', Decimal('55000.00'), datetime.date(2017, 11, 5), 2707)]

In [238]:
%%sql
select *, TimeSTAMPDIFF(DAY, hire_date, CURDATE()) as service_period
from employees;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
5 rows affected.

[(1, 'Alice Smith', 'Manager', Decimal('75000.00'), datetime.date(2018, 6, 23), 2477),
 (2, 'Bob Johnson', 'Developer', Decimal('65000.00'), datetime.date(2019, 8, 15), 2059),
 (3, 'Charlie Lee', 'Designer', Decimal('60000.00'), datetime.date(2020, 4, 12), 1818),
 (4, 'David Wilson', 'Developer', Decimal('68000.00'), datetime.date(2021, 1, 20), 1535),
 (5, 'Eva Brown', 'HR', Decimal('55000.00'), datetime.date(2017, 11, 5), 2707)]

In [240]:
%%sql
select * from employees
order by salary desc;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
5 rows affected.

[(1, 'Alice Smith', 'Manager', Decimal('75000.00'), datetime.date(2018, 6, 23)),
 (4, 'David Wilson', 'Developer', Decimal('68000.00'), datetime.date(2021, 1, 20)),
 (2, 'Bob Johnson', 'Developer', Decimal('65000.00'), datetime.date(2019, 8, 15)),
 (3, 'Charlie Lee', 'Designer', Decimal('60000.00'), datetime.date(2020, 4, 12)),
 (5, 'Eva Brown', 'HR', Decimal('55000.00'), datetime.date(2017, 11, 5))]

In [246]:
%%sql
select *, DATEDIFF(CURDATE(), hire_date) as service_period from employees
order by service_period desc;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
5 rows affected.

[(5, 'Eva Brown', 'HR', Decimal('55000.00'), datetime.date(2017, 11, 5), 2707),
 (1, 'Alice Smith', 'Manager', Decimal('75000.00'), datetime.date(2018, 6, 23), 2477),
 (2, 'Bob Johnson', 'Developer', Decimal('65000.00'), datetime.date(2019, 8, 15), 2059),
 (3, 'Charlie Lee', 'Designer', Decimal('60000.00'), datetime.date(2020, 4, 12), 1818),
 (4, 'David Wilson', 'Developer', Decimal('68000.00'), datetime.date(2021, 1, 20), 1535)]

In [264]:
%%sql
select name, salary from employees
where salary = (select max(salary) from employees);

 * mysql+mysqldb://root:***@127.0.0.1/testdb
1 rows affected.

[('Alice Smith', Decimal('75000.00'))]

In [266]:
%%sql
select name, DATEDIFF(CURDATE(), hire_date) as service_period from employees
order by service_period desc;

 * mysql+mysqldb://root:***@127.0.0.1/testdb
5 rows affected.

[('Eva Brown', 2707),
 ('Alice Smith', 2477),
 ('Bob Johnson', 2059),
 ('Charlie Lee', 1818),
 ('David Wilson', 1535)]